Catalogs/ВидыДокументовФизическихЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ВидыДокументовФизическихЛиц</Name>
			<Comment>АПК:413 ОбработкаПолученияДанныхВыбора ради допупорядочивания, допустима история выбора при вводе</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КодМВД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПФР</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитДопУпорядочивания</Name>
					<Comment>АПК:58 различия имени и синонима оправданы</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/КабинетСотрудникаПереопределяемыйРК/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

Функция ВидДокументаФизическогоЛица(ВидДокумента) Экспорт
	
	Если ЭтоКонфигурацияБК() Тогда
		Результат = ВидДокументаФизическогоЛицаБК(ВидДокумента);
	Иначе
		Результат = ВидДокументаФизическогоЛицаЗУП(ВидДокумента);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоКонфигурацияБК() Экспорт
	
	Возврат (Метаданные.Имя = "БухгалтерияДляКазахстана")
			ИЛИ (Метаданные.Имя = "БухгалтерияДляКазахстанаБазовая");
	
КонецФункции

#Область ЗУП_3_1_31_58

// ИнтеграцияУправлениеПерсоналомОбмен
Функция СклоненияПредставленияОбъекта(Представление, Ссылка) Экспорт
	
	Склонения = Новый Структура;
	СоответствиеПадежей = СоответствиеПадежей();
	Для каждого КлючиЗначение Из СоответствиеПадежей Цикл
		Склонения.Вставить(КлючиЗначение.Значение, СклонениеПредставленийОбъектов.ПросклонятьПредставление(Представление, КлючиЗначение.Ключ));
	КонецЦикла;
	
	Возврат Склонения;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ЗарплатаИУправлениеПерсоналомДляКазахстана

Функция ВидДокументаФизическогоЛицаЗУП(ВидДокумента)
	
	Результат = "other";
	
	Если ВидДокумента = Справочники.ВидыДокументовФизическихЛиц.УдостоверениеЛичностиРК Тогда
		Результат = "identityCard";
	ИначеЕсли ВидДокумента = Справочники.ВидыДокументовФизическихЛиц.ПаспортРК Тогда
		Результат = "passport";
	ИначеЕсли ВидДокумента = Справочники.ВидыДокументовФизическихЛиц.НайтиПоРеквизиту("КодМВД", "10") Тогда
		Результат = "foreignPassport";
	ИначеЕсли ВидДокумента = Справочники.ВидыДокументовФизическихЛиц.ВидНаЖительство Тогда
		Результат = "residenceCard";
	ИначеЕсли ВидДокумента = Справочники.ВидыДокументовФизическихЛиц.ВоенныйБилет Тогда
		Результат = "militaryIdentityCard";
	ИначеЕсли ВидДокумента = Справочники.ВидыДокументовФизическихЛиц.ПаспортМоряка Тогда
		Результат = "identityCard";
	ИначеЕсли ВидДокумента = Справочники.ВидыДокументовФизическихЛиц.ДипломатическийПаспорт Тогда
		Результат = "passport";
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область БухгалтерияДляКазахстана

Функция ВидДокументаФизическогоЛицаБК(ВидДокумента)
	
	Результат = "other";
	
	//Определение вида документа производить по наименованию элемента
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ЗУП_3_1_31_58

// ИнтеграцияУправлениеПерсоналомОбмен
Функция СоответствиеПадежей()
	
	СоответствиеПадежей = Новый Соответствие;
	// в ЗУП падежи на русском языке (заменяются в обработке МенеджерКонвертацииУправлениеПерсоналом)
	СоответствиеПадежей.Вставить(1, "nominative");
	СоответствиеПадежей.Вставить(2, "genitive");
	СоответствиеПадежей.Вставить(3, "dative");
	СоответствиеПадежей.Вставить(4, "accusative");
	СоответствиеПадежей.Вставить(5, "instrumental");
	СоответствиеПадежей.Вставить(6, "prepositional");
	
	Возврат СоответствиеПадежей;
	
КонецФункции

#КонецОбласти

#КонецОбласти
